{"Jupiter in Aries": ["If you have Jupiter in Aries, you are enthusiastic, assertive, energetic, and filled with many ideas on how to grow, start, promote, or expand the ideas which fill your head. You are opinionated and can be very persuasive in getting people to go along with your plans and ideas. You like dealing with the big picture and have leadership qualities. A need to learn patience and to think before you act is probable. Your tendency to promise more than you can deliver should be watched. Tolerance of others people's ideas and viewpoints should also be developed. You have the ability to sell things, ideas, material goods, philosophies. Over-optimism, conceit, self-centeredness, false pride, and fanaticism over some cause may be your biggest shortfalls with this position."], "Jupiter in Taurus": ["If you have Jupiter in Taurus, you desire to expand the world around you with practical, tangible, material things. The rewards you expect from your efforts must be material in nature. As a gesture of appreciation, a simple \"thank- you\" is not as good as some little something in the form of something concrete that you can hold and see. You are generous with your possessions and share freely what you have, but only if the cause merits such action. Your nature tends to be a bit extravagant or self-indulgent and it is up to you to control your desire nature. You may be stubborn in your philosophical or religious beliefs, needing proof of anything before believing. There is a fear of sickness and pain. Money and material possessions can come to you but you must use your resources wisely, else they will get you into trouble. A great love of rich or sweet food may lead you to become overweight. Control of the palate and of the lower nature should be observed."], "Jupiter in Gemini": ["If you have Jupiter in Gemini, you are clever, witty, and cheerful. You love traveling because of the knowledge you gain from your experiences and the people you meet. There may be a natural talent for learning and speaking foreign languages. Excessive nervous energy may lead to agitated speech or in the tendency to talk too much or promise more than you can deliver. There can be literary ability of a marked degree. Your mind is inventive, with a love of mathematics or other abstract subjects, along with the ability to understand them. You are constantly looking for those things in life which will expand your horizons and your own mental outlook or philosophy of life. Various religions or aspects of law may interest you mentally."], "Jupiter in Cancer": ["If you have Jupiter in Cancer, you are loving, peaceful, friendly, sociable, sympathetic and probably very patriotic. You have a most vivid imagination and have many Utopian dreams. There is probably interest in mystical things. You have good financial judgment, especially in real estate, with the ability to accumulate money and possessions, especially after mid- life. Much help is received from the parents. You may have weight problems, especially later in life because you do enjoy the delicacies of the dinner table. Your full potential may not be reached until middle or later life. There may be a tendency towards stinginess, holding on too long to memories and possessions. You may be a pack- rat. Maudlin sentimentality and over-emotionalism may also be problems for you."], "Jupiter in Leo": ["If you have Jupiter in Leo, you are generous, kind, compassionate and altruistic. You have organizing and executive abilities and crave positions of trust and responsibility, never being content to simply follow. You have an abundance of energy and a strong constitution. You love anything that tends to uplift society. On the negative side, though, you can become cruel, sensual, egotistical, ostentatious, abnormally fond of pleasure and subject to loss through speculation and gambling. You need to be admired for your generosity and warm-heartedness to all."], "Jupiter in Virgo": ["If you have Jupiter in Virgo, you have a cautious, intellectual, analytical, and practical nature with an uncanny ability to sift the wheat from the chaff and determine the essential from the non-essential and the truth from the fiction. Your judgment is usually excellent and this helps bring success in business or work in general. You have a strong desire to expand your field of knowledge and to develop technical skill. On the negative side, you can at times be cynical, carping, critical, and mistrusting of others. There can be times when you get lost in the details and lose the bigger picture. There may be a dislike for exercise."], "Jupiter in Libra": ["If you have Jupiter in Libra, you are philosophical, sympathetic and friendly. You expand your horizons and grow through using your ability to be outgoing with and well-liked by others. You have the ability to encourage others towards greater efforts. There is a love for beautiful things and perhaps an interest in art or law. On the negative side, there is danger of self-indulgence or extravagance, and a desire to improve social status through marriage rather than establishing a partnership based on true love. There may be more concern to demonstrate to the world that the marriage has been successful rather than happy. Much expense may be incurred through partnership, perhaps on account of the marriage partner's extravagant tastes."], "Jupiter in Scorpio": ["If you have Jupiter in Scorpio, you tend to be efficient and hard-working, with a flair for business and finance. You are resourceful and willing to do all the work necessary in the fulfillment of a task. You are secretive, but there is, also, great inner strength and courage. You have a magnetism that draws people to you. You have an ardent, aggressive, self-reliant nature and an enthusiastic, constructive mind. On the negative side, there may be trouble and loss through the indulgence of the lower nature and love of rich and expensive food and sickness on that account. Any tendencies for wild speculation and risk-taking should be controlled. There is interest in the occult. Strong healing abilities may be present. These energies are meant to be used to gain a higher consciousness and greater universal wisdom."], "Jupiter in Sagittarius": ["If you have Jupiter in Sagittarius, you are big-hearted, idealistic, loyal, generous, humane, broad- minded, philosophical and tolerant. There may be interest in religion, law, higher education or anything abstract. You may be prophetic and inspirational and you can inspire trust in other people. They are attracted to your sense of honor and integrity. You have a strong desire to help others and you have an ability to inspire them to help themselves. You may be in a position of power and prestige or work in the professions. You tend to be conservative because of a desire for people to like you. You must watch a tendency to justify yourself by rationalization. On the negative side, you may be too fond of sport or gambling, fond of cheap or extravagant display, self- righteous, narrow-minded, intolerant, dogmatic and atheistic."], "Jupiter in Capricorn": ["If you have Jupiter in Capricorn, your positive qualities are honesty, sincerity, faithfulness, ingenuity, resourcefulness and some degree of mechanical ability. Your attempts at growth, expansion, meeting new opportunities and getting ahead in the world are met with reserve, discipline, caution, system, practicality and organization. You have a desire for material success, yet this may not bring satisfaction or happiness if gained. There may be a tendency toward miserliness and withholding yourself from the rest of the world, financially and emotionally. You hate waste, are self-reliant and self-controlled, and possess a desire to have authority over others. You can rise to great heights if you stay honest, truthful, respectful, and keep your nose clean doing everything above-board."], "Jupiter in Aquarius": ["If you have Jupiter in Aquarius, you are a humanitarian and are concerned with the welfare of all people. You believe in the universality of life and the brotherhood of man. Reform and large group projects appeal to you as they give you wide scope for your own personal growth and expansion. You work well with others because of your inventive mind, your keen judgment, your fine intellect and your friendliness. You are intuitive, tolerant and sociable. You make an ideal diplomat, labor relation specialist or personnel manager because of your knack for handling various groups of people."], "Jupiter in Pisces": ["If you have Jupiter in Pisces, your needs for growth and expansion are perhaps best satisfied when you are working to help raise mankind to a higher spiritual level. You recognize that we are all in this together and what is bad for one is bad for all. You are sympathetic, charitable, genial, unassuming, quiet, visionary, intuitive, with a subtle sense of humor. You have an interest in spiritual or metaphysical ideas and issues, but you need to find your own path and experience Truth for yourself. Periodically retreating from society and the people closest to you is good for your nerves and your own mental health. The strong desire you have to help others comes out in your willingness to help the unfortunate. Perhaps you volunteer in hospitals, jails, or other places of confinement. You give hope to those who need it most. You probably love nature and large animals, especially horses. There may be an interest in healing. On the negative side you may be hypersensitive, over- emotional, too sentimental, have a tendency to exaggerate, or to be too extravagant or self-indulgent.", " ", "See more "]}