{"Venus in Aries": ["Venus desires relationships, sociality, and affection. Aries is forthright, demanding and wants to take the lead. Therefore, if you have Venus in Aries, you may be very ardent and pursuing in relationships. Your feelings and passions are easily aroused and you usually try to take the lead in social matters and affairs of the heart. You go out and get what you think you want. Trouble is, once gotten, you may get tired of having. The thrill of the chase is more important to you than the final catch. Thus your romances may start off in a blaze of excitement and glory only to end in boredom and monotony. There are always fresh fields to conquer and you go after them. It's almost a crusade for you. Venus worst qualities are trying too hard to please others and taking the line of least resistance. In relationships, then, you may choose partners who tend to dominate you and want you to do things their way at the expense of your own wishes. Venus in Aries calls for you to be assertive, yet not dominating, pleasing, yet not a dishrag. You are independent and have an impulsive approach to love. You like competitiveness and perhaps pick fights just for the action and excitement. You can be very inconsiderate of others because you sometimes do not think about your actions and they effects they have on those closest to you. Impatience and selfishness can be a problem for you. More about "], "Venus in Taurus": ["If you have Venus in Taurus, in love affairs you are generally loyal and steady, especially if your partner is demonstrative and affectionate. You are oriented towards the sensual side of life in everything you do and it may show through too much weight. You are tremendously responsive to beauty and physical appearances, and the physical attractiveness of your partner is very important to you. You enjoy indulging yourself and the ones you love and it is too easy for you to be extravagant and perhaps to put too much value in material things. Comfort is important to you and you hate getting your hands dirty. At times you can be lazy, hoping or expecting someone else to do the dirty work. Self-control needs to be developed and added to the qualifications you already possess -warmth, charm, sympathy, artistic. Guard against possessiveness, jealousy, and taking the easy way out in your relationships. You aim to please in practical and earthy ways."], "Venus in Gemini": ["If you have Venus in Gemini, in matters of love and romance, a person's sense of humor, intellect, and communication skills attract you more than their physical appearance. You desire a partner who is mentally stimulating, curious, one who can challenge your mind, and keeps you from getting bored. Relationships where talking, sharing ideas, going places, and learning new things together are highly preferred and needed. You need a lot of social stimulation and can be a bit of a flirt. Jealous and possessive partners turn you off. You are charming, friendly, and enjoy meeting new people. You can be fickle in matters of love and may have a tendency to desire more than one love interest at a time. You enjoy the fun and excitement of love, yet may fear its obligations. Your feelings can be well expressed through speaking, through writing or poetry, or perhaps through art where you get a chance to work with your hands. Your emotions are ruled by your mind and you may prefer intellectualizing your feelings. If Venus if poorly aspected, your breathing may be shallow and there may be poor oxygenation of the blood. More about "], "Venus in Cancer": ["If you have Venus in Cancer, you are quiet, shy, sensitive, sentimental, gentle, and romantic and your feelings are deeply attached to your family, old friends, familiar places and memories, and the past. Remembering and celebrating birthdays, anniversaries, family rituals, and other days of personal significance is very important to you. You seek caring, emotional support and security in love affairs. You can be changeable and inconstant in matters of feeling and emotion. You desire peace and harmony in your home environment. You cling to those you care about like a crab that won't let go. Carried too far, your love and concern for others may turn into a clinging, possessive, don't-let-go type of relationship. Feelings of insecurity or feelings of being unloved or un-nurtured may lead you to eat too much and thus gain weight. Your desire for rich or sweet food may contribute to the problem. Your mother probably had/has much to do with your feelings of love and affection. You like to be needed and your personal charm, magnetism and sympathy make you a natural caretaker. You have a need to mother others.  More about "], "Venus in Leo": ["If you have Venus in Leo, in affairs of the heart you are warm-hearted, spontaneous, ardent, affectionate, loyal and generous. You hate pettiness and stinginess in your partner. You seek the Hero, the Prince or Princess, someone you can idolize and adore, someone you have great pride in or someone who can sweep you off your feet. You crave love, appreciation, and attention from others and like to be at the center of things. You are rather susceptible to flattery and love to feel SPECIAL. You want and enjoy drama in your love life and some grand romantic gesture or extravagant expression of generosity impresses you. You dramatize your emotions. You are honest, frank, attractive, kind, compassionate, and fun-loving with a charming personality. You find it easy to be in love with love. You may expect too much of people and thus become easily hurt. You must watch a tendency to be preoccupied with your physical appearance when you should be developing your inner potential. Vanity and becoming a show-off is possible. You need to be admired for your inner and outer beauty.  More about "], "Venus in Virgo": ["If you have Venus in Virgo, you are quietly devoted and faithful to your loved ones, and often become a kind of servant to your love partner. You are more comfortable showing love for someone by doing something for them, making something for them, or simply being there for them rather than telling them so in a romantic sort of way. You are somewhat timid about expressing too much sentiment or emotion. You may lack confidence in your own attractiveness and ability to draw love to yourself. This could create doubt of your own worthiness to receive love and appreciation. There is a strong tendency to be very critical of the partner and too expect perfection. Marriage may be delayed due to the desire to find that perfect partner, which does not exist. You desire everything to be clean and orderly around you. A tendency to criticize and nag can be overcome be learning how to serve others in a simple way. You are able to be kind, tender, and sympathetic, thus you may excel at nursing. More about "], "Venus in Libra": ["If you have Venus in Libra, you are charming, tactful, courteous, considerate, balanced, poised, harmonious, and have a strong desire to please and not make waves. Because you try to be so agreeable, you have a difficult time saying \"no\". Thus people may take advantage of you. Although Venus is a so-called benefic planet, Venus in Libra can be fairly ruthless at times within relationships. With this position, one knows just what the other wants to hear and can thus be quite manipulative. You naturally attract people and things into your life when they are needed. Sometimes this happens so easily that you do not appreciate what you have. Harmony is valued so much that you will compromise a great deal in order to keep it. You do not like to dwell on controversial or emotionally difficult subjects and often try to \"smooth things over\" or \"sweep them under the rug\". In marriage and partnerships you want someone who is an equal, someone who balances you and your personality. You are attracted to people who have a certain finesse, delicacy, and subtlety. You appreciate good manners and refinement and are not happy with a coarse, blunt type of person. You possess magnetism and refinement and you relate well to others. You probably have musical or artistic ability or at the very least a fine appreciation of them, as well as good color sense. On the negative side, you may at times be lazy, wanting to take the easy way out or the line of least resistance. You can also be very indecisive. You need people and may find it difficult to feel comfortable in your own company.  More about "], "Venus in Scorpio": ["If you have Venus in Scorpio, in matters of love, you desire and crave a deep, intense, and passionate relationship. In love, nothing short of a merging of souls will satisfy you. Venus in Scorpio yearns for the undying love of Romeo and Juliet or Heloise and Abelard. Individuals with this Venus sign are the most intense, passionate lovers of all. The bonds you form are strongly emotional and may be described as possessive. You can get very jealous regarding loved ones. Uncontrolled jealousy and possessiveness may help destroy the relationships you are most intense about. You have a tendency to \"marry\" whatever or whoever captures your heart and it is difficult to let go of it or them for any reason. You can hold on to one love for a lifetime. High demands are placed on your partners. You are somewhat suspicious of even platonic, friendly relationships your partner has. If you are ever betrayed, you are capable of hating with as much force and intensity as you once loved. You are attracted to people who have an aura of mystery about them. You have a sultry charm, a personal magnetism. Although your feelings run deep, you may have trouble expressing them. Once burned you never give another a second chance. It is all or nothing at all. There can be a deep religious devotion which can serve as an outlet for your overcharged emotions. You need to learn the value of self-control. Misuse of the creative force in previous lifetimes has forced you to again deal with issues surrounding passion, desire, and regeneration. This position stimulates your creative ability and brings infatuations, misalliances, and love affairs.  More about "], "Venus in Sagittarius": ["If you have Venus in Sagittarius, in matters of love, you are looking for someone you can grow with, someone who can expand your world and your consciousness. You are attracted to someone who is fun-loving, playful, and open to adventure and new experiences. Traveling together, meeting new people and exploring new vistas is particularly enjoyable. People of foreign background and cultures enlarge your understanding of the world and yourself. You want to be able to share your dreams, aspirations and ideals with your mate. It is very important to you that you have a spiritual or intellectual rapport with your love partner, perhaps more important than the emotional/physical relationship. You are not especially sentimental and your partner may feel that you are too casual and not serious or romantic enough. You are sympathetic, kind, generous and optimistic. You idealize love. Always on the lookout for greener pastures, you may not stay long with a partner who doesn't help you to grow or provide you with enough excitement. You desire to share a love of God, expressed through religious devotion and a love of man, expressed through philanthropy and charity with the one you choose to love. More about "], "Venus in Capricorn": ["If you have Venus in Capricorn, love and affections are expressed in cautious, reserved and serious ways. You are probably not that demonstrative towards the ones you love. You care very much about what other people think of you and you fervently desire love and appreciation, yet your reserved responses make it appear that you are really very detached. Casual, superficial relationships don't interest you at all. You are cautious and serious about love and you want a deep, genuine, lasting love. You are old-fashioned and traditional regarding courtship and love, and will remain faithful to your loved one in good times and in bad. You may be attracted to persons older than yourself, someone who is emotionally mature and reliable and who can provide the security you desire. You tend to be loyal, trustworthy, patient and steadfast. For you love may be weighed against practical concerns or on the basis of security needs. Perhaps you'll marry for money or status. You have a strong desire to protect yourself from being hurt and this may keep you from being as outgoing and forward in love matters. You may be very fearful, selfish and jealous or cold and calculating if Venus is badly aspected. There may be an intense ambition and desire for prestige and status. More about "], "Venus in Aquarius": ["If you have Venus in Aquarius, your affections are expressed in an open, unconventional and rather detached way. Socializing, bringing people together and having many friends and acquaintances very much appeal to you. Because you value friendship so highly, you may be more comfortable being a friend than a lover. One thing's for sure – you highly dislike possessive, clingy relationships. You want to be free to do whatever you want with whomever you like. You want an intellectual or spiritual connection with your partner and this may even be the preferred substitute over a very intimate or emotional bonding. You need a partner who will give you plenty of freedom, allowing you to be your own person, and not be too demanding emotionally. You are charming, happy and original, but also, cool, calm and detached. This detachment is beneficial because you, as a rule, are never possessive of people or things. The feelings you have tend to be filtered through your mind and intellectualized. You need to learn warmth and understanding. More about "], "Venus in Pisces": ["If you have Venus in Pisces, your affections are expressed in sympathetic, compassionate, softhearted, romantic ways. You unselfishly give of yourself to those you love or to those who need or ask for your help. You may be a sucker for any sort of sob story and perhaps give too much at times which make some overly dependent on you. You are very idealistic in matters of love and this sometimes plays itself out whereby you become the martyr or the savior in relationships. You tend to be more compassionate than passionate and you become involved with others because they need love or need to be \"saved\" and you want to help them rather than out of mutual attraction or pleasure. You attract and are attracted to those who are sensitive, imaginative, or musically or artistically inclined. Your desire is to find someone you can have a deep, spiritual relationship with. You idealize love and have a very beautiful, romantic vision of what love can be. At times you can simply be in love with love. You may be highly emotional, perhaps overly so, sensitive, artistic, compassionate, gentle and psychic. You can be too easy-going or submissive and allow yourself to be taken advantage of because you do not want other people to feel let down and you don't like to make waves. You may have the attitude that somehow you must suffer in love, and do so willingly.", "    ", " ", "See more "]}