{"Mercury in Aries": ["If you have Mercury in Aries, you are outspoken and direct in speech and actions. Your thoughts are original and filled with enthusiasm and great energy. You love a good argument or debate and like to compete and strategize with your mind. You say what you mean and don't pull any punches. You are opinionated and love to share those opinions, even if not asked to do so. You love controversy and might need to develop a little more tact in how you express your own thoughts. Your mind is restless and filled with much nervous energy. It is hard for you to sit still. You always have to be busy, especially with your hands. Mechanical ability may be present. Your thoughts and words are quick and impulsive and you may at times suffer from foot-in-mouth disease. A lack of patience and concentration in carrying out your plans may be evident. Great wit and an entertaining personality help make you popular. You don't like to be told how to do things and want the freedom to do things your own way. There never seems to be enough time to do all the things you have on your mind. You may be quick-tempered, but hardly ever carry a grudge. You get over things quickly, then move on."], "Mercury in Taurus": ["If you have Mercury in Taurus, your manner of thought and speech is slow and quite deliberate. You do not change your mind quickly and see no reason to do so. You are determined, practical, methodical, and conservative in most things you do. You have patience and the ability to stick with things until the end. You may assimilate material at a slower pace than others, but once a concept is learned, it is never forgotten. You hate being forced or rushed into a decision or an action, especially if you have not been given time to think it all through and evaluate the practicalities of the situation. Once your mind is made up, that's it. It will take a lot to undo it. Perseverance is one of your best traits. You enjoy sustaining what others have started, especially if you can see tangible, practical results. You love to build things. You succeed not so much because of your mental brilliance, but because you have the ability to concentrate and follow a project through to its completion. You may have an artistic or musical aptitude. Perhaps you sing or speak for a living. Common sense is not uncommon in you."], "Mercury in Gemini": ["If you have Mercury in Gemini, you have an extremely adaptable, energetic, active, alert, curious, and versatile mind. You seek knowledge, either through reading or conversation, or through travel and talking with the new people you constantly meet. You have so much nervous energy that this can sometimes cause great stress which must find an appropriate release. Exercise is a good way to release this tension. You are clever, witty, and always have a joke or comeback ready for any situation. You love being involved in multiple things at once and this may be a problem – too may irons in the fire at the same time. You are quick to grasp new concepts and equally quick to lose interest in an idea or project once your curiosity has been satisfied. You like to taste a little bit of everything – concentration and disciplined study are not your strong points. You are handy with your hands and may be ambidextrous or mechanically inclined. Debate and argument appeal to you. There is a tendency to scratch the surface with the things that strike your interest without learning anything very deeply. This is the jack-of-all-trades, master-of-none position. There is danger, then, of superficiality. Control of thought, word, and action is necessary in order to be successful. Find your focus, stay with it and develop perseverance. Journalism, speaking, teaching, sales, advertising, or writing may appeal to you. Mentally restless, you may change jobs or locations frequently, or do work that involves movement, travel, and variety. You grasp concepts easily and may become impatient with those who don't learn as quickly."], "Mercury in Cancer": ["If you have Mercury in Cancer, your mind is connected with your memories, feelings, and emotions from the past. You tend to hold on to the memories of things because they give you security. You are highly interested in inner, subjective, and personal issues, and your thinking is based more on feelings, intuition, personal experiences, and prejudices rather than reason or logic. Intellectual abilities and accomplishments without heart or soul mean little to you. You are a sensitive listener and deeply interested in a person's feelings and inner life. In addition to psychology, you are probably drawn to education, art, poetry, music, or mythology. You are shy and somewhat reticent about speaking in public, but you will open yourself up and share your thoughts in small, intimate, little family-type circles of people you know and trust. You perhaps enjoy keeping a diary or chronicle of your thoughts and feelings regarding your day-to-day happenings. Your mind retains and absorbs knowledge easily. You are intuitive, psychic, and sympathetic, yet may become depressed over your own problems and the problems of the world. You may have difficulty in getting to the root of the problem because you so easily become involved emotionally with the people instead of the problem. You may have difficulty in making decisions or you may simply change your mind constantly. Mental focus and control must be developed."], "Mercury in Leo": ["If you have Mercury in Leo, you have strong, fixed opinions and love to express your thoughts energetically and dramatically. You wholeheartedly identify with your beliefs. You can be a warm, convincing, entertaining speaker and an effective story teller. Exaggeration plays a key role in all your tales and expressions. You put on a good show no matter who the audience is. You have a distinctive style of expressing yourself. Teaching ability is present. You have many creative ideas and want to have a voice in decision-making. You take great pride in your mind and thought processes and others may think of you as a bit of a know-it-all. You need to watch a tendency towards false pride, intolerance, stubbornness, needing appreciation for everything you do or say, and becoming overly impressed with your own abilities. You could be a good politician, spokesperson, group leader, director, or coach. You need to be admired for your mind. "], "Mercury in Virgo": ["If you have Mercury in Virgo, you are an exacting perfectionist with a clear, logical, and analytical mind with an aptitude for work that requires meticulous attention to detail and efficient organization. Well-grounded, practical, and possessing a great deal of common sense, you tend to develop specialized skills and technical expertise in some practical field. Knowledge, ideas, and theories don't really interest you unless they are useful in a practical, tangible way. You love to analyze, measure, and dissect everything, but perhaps you miss hints, nuances, and subtle shades of feeling and meaning. Your strengths are in your precise thinking, careful craftsmanship, and mastery of technical skills. You tend to be very good at what you do and are critical of others' work if it does not meet your high standards. You are systematic, adaptable, stable, flexible, and good with details, although you may have a tendency to be pessimistic, sarcastic, intolerant, complaining, whiny, critical, or get lost in the details and lose the forest for the trees."], "Mercury in Libra": ["If you have Mercury in Libra, one of your best talents is your ability to see all sides of an issue, and to negotiate and bring about compromise and reconciliation. You are diplomatic, fair, tactful, and reasonable, possessing considerable social finesse. You work well with all groups of people. You are objective and somewhat detached from emotional bias and may make an excellent consultant, mediator, or public relations person. You insist upon fair play and seek peace and harmony in all situations. Your fine aesthetic sensitivities allow you to work in artistic or cultural environments. You have a persuasive, rational, well-balanced mind with artistic sensitivities. You are flexible and willing to listen to all sides of an issue. This may lead to vacillation and indecision, though, because sometimes you cannot make up your mind as to which side has the most merit. Your thinking process works by means of comparing things and finding analogies. This is when you are at your best."], "Mercury in Scorpio": ["If you have Mercury in Scorpio, you have excellent mental concentration and the ability to become completely immersed in your work. You love ferreting things out and are a natural detective. Your mind may dwell on the sensual side of life and may think about sex or death often. You seem to know things at an instinctive, nonverbal level and prefer learning through direct experience or apprenticeship rather than vicariously via books or lectures. You have mechanical ability and work well with your hands. You may develop healing ability through your hands. You are quick-witted, resourceful, shrewd, direct, sharp-tongued, and will readily say what is on your mind, in a most stinging manner. You enjoy satire and other forms of critical humor. You want to know everything while at the same time disclosing nothing to no one. You have the ability to penetrate beneath the surface of problems and people and really understand them. You have abundant manual dexterity with the ability to repair anything. On the negative side, you can be stubborn, quarrelsome, skeptical, cynical, headstrong, and always holding the opposite views to others. There is interest in the occult."], "Mercury in Sagittarius": ["If you have Mercury in Sagittarius, you possess idealism, vision, and foresight, and your mind is often occupied with big ideas, plans, and goals for the future. You are interested in what is possible and what is on the horizon, rather than what has already been done. Subjects like philosophy, religion, politics, or education interest you, and you are more concerned with theories, abstractions and concepts than with specific applications. You are not inclined to focus on any one practical, concrete area. You don't particularly like details and may find it difficult to concentrate long enough to carry your ideas through to completion. You seek mental freedom, yet your thoughts are usually along traditional lines. Having a gambling instinct, you may enjoy gambling, speculative enterprises and new ventures. You are forward, blunt and direct in speech and you always speak your mind. People who know you know that you don't beat around the bush. You are apt to say the first thing that pops into your head. Thus, you have to learn to control your tongue, develop tact, and to think before speaking. Business, advertising, and promotion might be good career areas for you. You have a keen mind and are impulsive and versatile. You have a tendency to study several similar subjects, to have more than one job and to have several projects going all at the same time. You tend to want to keep on the move, traveling, in order to gain experience, knowledge and wisdom."], "Mercury in Capricorn": ["If you have Mercury in Capricorn, your mind is clear, disciplined, serious, practical, organizing, objective and realistic, and you are unimpressed by exaggerated claims or promises. You want to know the facts behind any statement or idea you hear. Your natural skepticism often borders on cynicism. You have a rational approach to problems and are usually quite level-headed no matter what the circumstances. Your are capable of working long hours with focused concentration and attention on whatever interests you. You probably have a good memory and are very attentive to details. At times you appear to others as lacking a sense of humor, boring, or depressed. You simply have a lot on your mind. You are thorough, conscientious, and disciplined in your thinking, and have an aptitude for business, organization, and administration. You are also a good strategist, and will plan and patiently follow a realistic course which will lead to your eventual success. Serious-minded and studious, you enjoy quiet time alone for thinking or reading. You seldom indulge in foolish or silly chatter for you consider them a waste of valuable time which is better spent on more productive things. "], "Mercury in Aquarius": ["If you have Mercury in Aquarius, your thoughts tend to be unique, unusual, rapid and coming completely out of the blue, eccentric, unconventional, scientific, weird and perhaps a bit ahead of their time. You are a progressive and non-traditional thinker and are very open and receptive to new technologies and breakthroughs and the latest discoveries in any field. You believe that humanity can resolve their problems through creative intelligence using inventive minds and scientific principles. You are a bit impatient with those who are conservative and unimaginative and those who are afraid perhaps to think about and try new things and ideas. Keeping abreast of the latest developments and technologies is fun for you. Reading science fiction helps give you food for thought regarding radically new ways of looking at things. You have a strong humanitarian impulse, an aptitude for organization and you enjoy being involved in cooperative group efforts or businesses that are contemporary and innovative. You have a versatile, disciplined, practical and original mind. You are intuitive and resourceful, with the ability to correctly judge human character and penetrate the mask that others wear. You follow your own convictions regardless of what others think of you and you have the ability to express your ideas clearly so that others easily comprehend. On the negative side you can be eccentric, bohemian, radical, revolutionary and stubborn."], "Mercury in Pisces": ["If you have Mercury in Pisces, you, your thoughts, and your ways of communicating tend to be idealistic, psychic, intuitive, imaginative, sympathetic, diplomatic, extremely sensitive, compassionate, and visionary. On the negative side you can be lazy, impractical, day-dreamy, over-sensitive, procrastinating, indifferent and absent-minded. You may lack a strong desire to work or to push yourself into doing anything that takes a lot of strength, organization, patience, and responsibility. You would rather be a poet or musician than a scientist or a mechanic. Formal book learning may not be your area of strength, yet you can absorb knowledge in the most remarkable ways if you are interested in the subject area. You are sensitive to your environment and thus you should be careful of which environments you hang around in. Your nerves and your mental health require you to periodically rest away from the noise of the work-a-day world. Take some time to be alone with yourself to regroup. But not too much time, as you have a tendency to get carried away with yourself and your problems. Healing using visualization techniques or healing through the laying on of hands may appeal to you. You may have great interest and talent in art, music, drama or poetry. Your imagination can be quite highly developed. Because you tend to think in terms of mental abstractions, translating your thoughts and impressions into concrete, everyday language may be difficult for you at times and consequently you may appear less intelligent or at least less quick-witted and verbal than others. You dislike being pinned down to facts and you follow your instinct rather than logic. You are intuitive and able to sense what others' thoughts and feelings are, even before they say anything to you. Sometimes you get so immersed in your own world of thought and imagination that you overlook things in your immediate, tangible environment. You are extremely open-minded and believe that anything is possible. Intangible or spiritual forces seem just as real to you as anything in the concrete world and you often form an opinion about a person or situation without much factual knowledge of them, and your impressions are usually correct. Keeping your mind positively occupied is important, as day-dreaming tends to go off in strange directions.", " ", "See more "]}