{"0": ["You are consistent.", "You are reliable.", "You tend to be dependable."], "1": ["You are patient unless someone takes you too far.", "You are usually slow to anger unless someone takes you too far."], "2": ["You tend to be industrious, efficient, practical, exacting, scientific, organized, shy, thrifty, studious, economical, and punctual.", "You tend to be versatile."], "3": ["You tend to be idealistic.", "You tend to be optimistic."], "4": ["Your work is usually neat.", "Your work is usually orderly."], "5": ["You prefer a regular routine, defined responsibilities.", "You prefer a regular routine, defined tasks."], "6": ["You have common sense to manage others.", "You have the ability to manage others."], "7": ["Your mind is analytical."], "8": ["you dislike dirt."], "9": ["Your mind is deep."], "10": ["you dislike messes."], "11": ["You grasp concepts easily."], "12": ["You tend to be friendly."], "13": ["You are romantic."], "14": ["you probably have a good head for numbers."], "15": ["You never give up."], "16": ["You are sentimental."], "17": ["You may be ambidextrous or mechanically inclined."], "18": ["You tend to be open-minded."], "19": ["You are usually outspoken, sometimes to the point of bluntness."], "20": ["You may become impatient with those who do n't learn as quickly."], "21": ["You are very direct in thought, action, and speech and everyone knows how you feel."], "22": ["You are gentle."], "23": ["Debate and argument appeal to you."], "24": ["You are quiet."], "25": ["You are handy with your hands."], "26": ["You never find it difficult to change your mind or course in mid-stream."], "27": ["Money and possessions are important to you for the feelings of security they bring."], "28": ["You are courageous."], "29": ["You are adventurous."], "30": ["You tend to be honest."], "31": ["You are sensitive."], "32": ["You enjoy building and seeing the results of your hard work."], "33": ["Keeping things going is your strength, especially once someone else starts them."], "34": ["Whatever you have set your sights on, you refuse to give up or let go of it."], "35": ["You can handle more of the workload than most around you."], "36": ["You may be a bit of a perfectionist."], "37": ["You are independent."], "38": ["You are shy."]}