{"Mars in Aries": ["If you have Mars in Aries, you are aggressive, pioneering, adventurous, and always on the outlook to start new projects. You hate restraint and don't like to be told to do something or how to do it. You want to lead, not follow. At times you can be headstrong, impulsive, and impatient. Waiting is not something that appeals to you. You go after what you want with great zeal and you do not take \"no\" for an answer. You love competition and anything that allows you to test or prove yourself. Cooperation is not your strong suit and you can be very self-willed, self-absorbed, and selfish at times. The \"me-first\" attitude is strong in you. You are self-reliant and hate depending or relying on others. You need to be our own person and do things your way, even if it might not be the best way. Your best talent is in getting things off the ground quickly. If initial success does not come quickly, you may get tired of that project and move to the next. Sustaining is not your strong side. Long term efforts are not as appealing to you as quick, short term affairs that you can finish with quickly so you can start something else. Energy and enthusiasm are your strong side. Self-control is important for you to learn so you don't burn out. Physical activity and keeping in shape appeals to you. You may be prone to accidents due to haste. You need to learn to stick to a project until it is finished before rushing off on a new endeavor. You must learn to control your temper and impulsiveness."], "Mars in Taurus": ["If you have Mars in Taurus, once you set your mind on a goal, your dedication, determination, and commitment to it are extraordinary. You never give up and find it difficult to change your mind or course in mid-stream. Whatever you have set your sights on, you refuse to give up or let go of it. You are loyal to a fault, unless someone betrays your trust, then all heck can break loose. You are patient and usually slow to anger unless someone takes you too far. That is when you charge, just like the bull Taurus stands for. You are reliable and consistent and can handle more of the workload than most around you. You prefer a regular routine, with definite hours and clearly defined responsibilities and tasks. You enjoy building and seeing the results of your hard work. Things you can put your hands on appeal to you. You need to see practical results, not theory and you are not satisfied with intangibles like just having a good time. At the same time, you have a lazy, comfort-loving side and there is often a good deal of inertia for you to overcome before you get going. Once you get a momentum going, your energy level is strong and steady. Keeping things going is your strength, especially once someone else starts them. Material well-being and security are large factors in determining what you do. Your stamina and persistence is your great strength but it can also work against you; you can get caught in a rut and refuse to seize new opportunities. You also tend to play it safe and to limit yourself in that way. Change scares you. So does disease and pain. At times you have a decided stubborn streak where no one can reach you. Possessiveness and jealously may cause problems for you in relationships. Money and possessions are important to you for the feelings of security they bring. Re-evaluate your values. Sharing should be cultivated. Your tongue may be quite unruly at times. "], "Mars in Gemini": ["If you have Mars in Gemini, mentally and physically you are the busy, little bee. You are constantly in motion with many and various activities, usually several at a time. You are happiest when busy and you hate boredom. Your mind is alert, active, and constantly seeking to learn more. You absorb knowledge like a sponge and you will debate and argue with anyone who wants a mental sparring match. A great deal of nervous tension or anxiety can exist with this position and it is important that you get regular exercise to relieve the stress. You talk with your hands and may be ambidextrous or have mechanical ability. There is a need to think before acting and to have patience so that you keep yourself out of trouble. Sometimes you just do things for the sake of doing something and this is not always a good idea. Look before you leap. Travel appeals to you because you never know what you might learn or who you might meet. Burns or accidents can occur to the shoulders or arms, probably due to haste. You can accomplish a lot in short bursts, but projects that require long-term commitment, stamina, and steady, persistent effort are not easy for you. You often scatter your energies into so many directions and activities at once that you cannot finish or follow through on some of them. You need variety, change, and mental challenges. Your mind is sharp and you enjoy mental challenges, games, or competitions. Matching wits with someone else really brings out the competitor in you. Your drive and energy is more mental than physical. You use your wit, intelligence, communication skills, social sophistication, and awareness to achieve your goals. Sarcasm and humor come easy to you. You need to learn how to conserve energy so you don't burn out and concentration so you will complete projects and carry through on promises."], "Mars in Cancer": ["If you have Mars in Cancer, you avoid direct confrontations with others, preferring to side-step issues or attack them indirectly. Aggressive, competitive behavior makes you uncomfortable. Your ego drive is not very strong and you are not especially ambitious or eager to push your way to the top. Inner satisfaction is more important to you. You may feel inadequate in situations that call for strong, forceful action. But, when you feel your loved ones or your family or anyone you really care about is being threatened, then you will fight and defend with all the tenacity in the world. That brings out the very strong protective side in you. Impulse and instinct take over and you will battle until the end, if needed. Your goals and actions tend to center around your family and loved ones and they are very personal. Great sacrifices can be made for them, even though they may be in the wrong. Being sensitive to stress, you do not handle high-pressure, competitive situations very well. You can be very touchy, moody, irritable and difficult to be around when there are many demands or tensions at work. Your energy level is not constant and is very dependent on your emotional state at the time, especially as regards your emotional harmony or discord at home. You should avoid eating when emotionally upset as this plays havoc with your digestive system. You are hard-working, sympathetic, moody, defensive, tenacious, intuitive, instinctive, sensitive, and perhaps over-emotional. Control of your emotions is important to your health and well-being."], "Mars in Leo": ["If you have Mars in Leo, you are proud and probably have a big ego. You want to excel, to stand out and be recognized for who and what you are. You like to be Number One. It is difficult for you to take orders or to stay in the background. You like to be noticed and will do things in a dramatic manner just to get attention and be seen. You hate being wrong and may insist that you are always right. You are forceful, strong, energetic, artistically creative, determined, and highly competitive. You play hard, you play to win, and you do not give up easily. In fact, you see life as a competitive sport, game or performance. You love admiration and applause, and you have a strong sense of personal honor and integrity. You tend to be very self-confident, even arrogant. But you may become self-conscious, defensive, and rather belligerent if your self-confidence is shaken. You tend to be enthusiastic, rather impulsive, full of energy, and ambitious. You are very ardent in matters of love and will pursue your love interest with great fervor and passion, letting nothing get in the way of your desires. You don't beat around the bush, but say exactly what you feel, often in an embarrassing direct way. On the negative side, there may be a love of taking risks or of gambling. You can be quarrelsome, argumentative and jealous. There may be heart trouble if physical activity is overdone when you are not in shape or if anger is allowed to vent destructively. Energy and passion both need to be disciplined. You need to be admired for your actions."], "Mars in Virgo": ["If you have Mars in Virgo, you are an energetic worker, a perfectionist, and you have high standards for your own work. You often feel that if you want something done right, then you must do it yourself, for others never do as thorough a job as you do. Doing a task well is very important to you, and you may labor over minute details that others wouldn't other "], "Mars in Libra": ["If you have Mars in Libra, you swing from being too pushy, aggressive, confrontational, and insistent on doing things your own way to being too eager to please and too compromising. You have a strong attraction to the opposite gender and if Mars is well aspected, then this brings popularity and good will. But if Mars is badly aspected, then this can bring opposition and criticism from the public and the opposite gender, fickleness in love relationships, and trouble from toying with the affections of others. Desire for competition and cooperation swing back and forth. You seek a balance between acting independently and assertively and working cooperatively and interdependently with others. You may feel frustrated at times that you cannot simply do what you want to, that you must always accommodate the needs and desires of others. Or you may feel hesitant to act in a positive, assertive manner if you do not have the support and approval of other people. Either way, you are not a loner. You achieve your goals by collaborating and joining forces with others, by being a team player. You are very concerned with the concept of fairness and become quite vocal if you sense someone is being taken advantage of. You may be attracted to legal pursuits. You avoid extremism and favor a balanced, moderate approach to living. You are unlikely to push yourself too hard or to become fanatically driven to reach your goals. You tend to be persuasive, perceptive, enthusiastic and easygoing, although at times you can be argumentative. Diplomacy and patience may need to be cultivated."], "Mars in Scorpio": ["If you have Mars in Scorpio, you are extremely strong-willed and you pursue your goals and desires with passionate dedication and determination. You are capable of total concentration and tremendous discipline, and you are very difficult to influence once your mind is made up. When you want something, you can be very one-sided and almost obsessed with it. You tend to be secretive and you do not want others to know what your plans are. You tend to be instinctive, perceptive, determined, strong-willed, stubborn and magnetic. You have deep emotions and may occasionally show a primitive side. You need to learn self-discipline or your desire nature will rule your life, probably causing great sorrow in the end. You must learn to control your jealousy and possessiveness in matters of love. A certain amount of detachment in relationships would probably be good and this, of course, would include your tendency to treat loved ones as possessions. You are very forceful in a quiet and subtle way and others may have difficulty in seeing or understanding your motives. You can manipulate people in a way that is not obvious to them or others. Direct confrontation with others is not your preferred style. You like operating behind the scenes. In any case, you are a formidable opponent when riled. In matters of health, there may be a tendency towards hemorrhoids."], "Mars in Sagittarius": ["If you have Mars in Sagittarius, you are aspiring, enterprising, idealistic, and forever following some bright and distant star, planning some new venture or investigating new potentials that will expand your horizons. You are a rolling stone. You aim high and are not content simply with a quiet, secure existence. You like to stretch your limits, to see how far you can go, and to take risks. You are a positive thinker, expect success for yourself, and are philosophical about failures. You are flexible and bounce back from disappointment rather quickly, usually with another hopeful new idea you want to try. Your enthusiasm and confidence are contagious and enable you to enlist the aid and support you need for your projects. However, you sometimes promise more than you can actually deliver, due to over-optimism or insufficient attention to the practicalities involved. You also tend to get distracted and sometimes have too many things going at once. Although it may be very difficult for you, there are times when you must simply develop and show commitment, perseverance, and persistence in order to make your dreams and goals a concrete reality. Too often you fall short of what you could attain because you are unwilling to persist through the difficult or less exciting times. You also enjoy competition and usually do not take it too seriously. You tend to be friendly, optimistic, impulsive, enthusiastic, independent and argumentative. You may be an active traveler. Your energies need to be used in physical outlets and you may be an athlete. You have a tendency to exaggerate. You may also have strong religious and philosophic convictions and can go \"crusading\" if you feel the cause is just. On the negative side you may be sharp-tongued, quarrelsome, disagreeable, self-righteous, verbose, intolerant, and dishonest."], "Mars in Capricorn": ["If you have Mars in Capricorn, your actions serve your ambitions for power, recognition, distinction, and status. You are not content to follow, but must have a leading role in whatever you do. If not handled well, the energies of this placement can make you appear ruthless, manipulative and bull-dozing over anyone who stands in your way. You are efficient, tenacious, organized, dedicated, practical, disciplined and steadfast in your resolve to feel successful. Your drive and energy are directed toward practical material accomplishment and achieving concrete results. You are hard-working and capable of foregoing immediate comfort in order to achieve your long-range goals. You can easily become a workaholic and are very responsible and conscientious about doing a thorough job. You don't tend to gamble when it comes to implementing your plans but generally prefer the conservative, tried-and-true route and then following through with it. You rely on your own efforts and perseverance rather than luck or good fortune. There is a natural shrewdness and instinct for business or organizational management. You tend to be ambitious, persistent, patient, self-reliant and responsible. You are apt to be slow in learning, but there is total assimilation of knowledge. Your energy is carefully used. Success is very important to you. On the negative side you may have a quick irritability which needs to be controlled and a tendency to feel resentment toward others for supposed hurts. You need to learn how to forgive and forget and how to release your emotions and frustrations positively."], "Mars in Aquarius": ["If you have Mars in Aquarius, your energies are expressed in unique and original ways. There may be genius shown in the way you go about things. You are inventive, scientific, a bit eccentric, unconventional and perhaps a bit rebellious. Working with others to get things done appeals to you. You enjoy taking part in sociable, group activities and unite with others of similar ideals and persuasions. You are progressive, democratic and you are not concerned with hogging personal power or having authority over others. You are a team player. New and unusual methods of work, planning and technology appeal to you. Your energy levels are usually high, but they can be erratic at times and you may find a tendency to work in spurts. Thus, you can be impatient and inconstant in pursuing your desires. You are intellectual, cautious, independent, freedom-loving and enterprising. You respond well to emergencies. There may be interests in mechanical or scientific subjects. Science fiction may intrigue you. You may need to control a radical or rebellious streak within and remember that in certain cases haste does make waste. On the negative side you can be too aggressive, quarrelsome, contentious and perverse."], "Mars in Pisces": ["If you have Mars in Pisces, your energies and aggressions tend to come out in non-combative and noncompetitive ways. You are a bit of a pacifist and do not enjoy tackling anyone or anything head-on in a directly confrontational manner. Working around people or situations or working behind the scenes, in secret, is more your preferred style. If necessary, it is more your tendency to give up something rather than to fight for it. Because your ego is not especially interested in personal achievement, glorification, material advantage, or winning at the expense of someone else, you may come across to others as weak-willed or ineffectual. Being on top, being the best, or being first doesn't mean much to you, hence you can be quite happy in a supporting role, working for the benefit of others or for a cause that you believe in. You may experience difficulties in planning clear and definite goals for yourself in the real world. You are not sure what you want out of life, except you instinctively seem to know that you do have and need to find a spiritual purpose. You have many dreams, high ideals, and a strong mystical or religious impulse. You also have a creative imagination and can successfully apply yourself to art or music. You are intuitive, humorous and diplomatic, quiet on the outside, but restless within. On the negative side you can be indecisive, procrastinating, too interested in the sensual side of life, and may resort to using drugs or alcohol as a way to escape the pressures and responsibilities of dealing with everyday life. Learning self-control is important for you. Take action, don't only day-dream.", "    ", " ", "See more "]}