{"Saturn in Aries": ["The best quality of Saturn is system and the best quality of Aries is leadership. Therefore, if you have Saturn in Aries, you can be a very capable leader, one who knows what to do and is not afraid of going out and doing it no matter what it takes or how long it takes. Combat and competitiveness spur you on to greater achievements. Self-reliance is high within you and you probably feel that you are more capable than those around you, hence you may end up doing all the work, which may antagonize you if you feel that others are not holding up their end of things. Saturn's worst quality is selfishness and Aries worst quality is interference with the plans of others. Therefore, you are also capable of meddling and trying to run the affairs of others. You may run roughshod over them in trying to get them to do your will rather than their own. You can be a real slave-driver. You dislike restraint of any kind and do not take kindly to others telling you what to do. Remember this as you give the orders. Obstructions, frustrations, and limitations come into play in your pioneering, self-starting efforts. Freedom comes only through responsibility and discipline. Impatience can ruin all the good work you try to do. Caution may need to be developed in the carrying out of your plans. Stability and security are important to you and you work with those thoughts in mind. Feelings of being inadequate may spur you on to tackle immense undertakings in order to feel more valued or worthy. Stress from trying to accomplish too much may make you prone to headaches. Saturn in Aries calls for you to be self-sacrificing."], "Saturn in Taurus": ["If you have Saturn in Taurus, you are very persistent in carrying out your goals. You can be overly concerned with material possessions and in wanting to squirrel away too much for that proverbial rainy day. You tend to place too much emphasis on material goods and possessions for security and if carried too far, you can become miserly and miserable due to worrying about what might happen tomorrow and will you have enough money to cover things. You need to re-evaluate your values and where true security comes from. On the positive side, you are a tireless worker and have patience, caution, determination, discipline, organizing ability and can go the distance when those around you fall. Hard work is your forte. Your feelings are serious, well-controlled and not easily changed, although at times it may be hard for you to forgive and forget. Loyalty is important to you. Building structures that last is a need you have."], "Saturn in Gemini": ["If you have Saturn in Gemini, your thinking is deliberate and serious and you possess organization skills, concentration and mental stability. You can focus on deep and difficult matters and come up with practical solutions to problems. You enjoy learning. But there may also be tendencies towards cynicism, depression, and pessimism. Nervous tension can be a problem and the intake of air into the lungs or the oxygenation of the blood can be restricted. Your lungs need plenty of oxygen. It is best for you to sleep in a well-ventilated room. Saturn here steadies your mind and helps control the natural flightiness of Gemini. This is a good position for Saturn, but you may need to develop faith in the future. It will be important for you to discipline your mind and learn to think and act methodically if you are to be successful in anything."], "Saturn in Cancer": ["If you have Saturn in Cancer, you are protective and persevering and you worry over loved ones. You can be moody, fearful and insecure perhaps because you feel unloved, probably by one or both parents. These feelings may bring on within you feelings of inadequacy toward your own ability to be a parent. As a parent you may be very demanding and a strict disciplinarian to your children. Emotional depression is something you need to conquer. Your unconscious fear of being hurt by others can cause you to withdraw from too close an emotional involvement with others. You are kind, but may lack empathy. You can be so busy protecting yourself from hurts that you are unable to see the hurts of others. There is a tendency for improper digestion due to the lack of certain digestive juices in the stomach. It would be best if you did not drink liquids with your meals (except milk, which is a food). There is a need to curb the appetite, as it can get you into trouble. Land and property may give you emotional security and alleviate feelings of not having something to fall back on."], "Saturn in Leo": ["If you have Saturn in Leo, you possess diplomatic, organizing, executive, and leadership ability along with a strong will. You tend to be self-reliant, conservative, and are extremely efficient. You may have difficulty expressing your emotions and your affections, which may make you appear cold and unloving. You need love, but may not know how to go about giving or receiving it, thus you may isolate yourself from others. Your love is motivated by strong feelings of duty and responsibility and you show your love by taking care of business and doing what is required or by giving material things to loved ones instead of yourself, which is what they really want. On the negative side, you may be cruel and quick-tempered, jealous, and may resort to underhanded means to satisfy your ambitions. Heart trouble is possible with this position. You need to be admired for your ability to get things done efficiently and effectively."], "Saturn in Virgo": ["If you have Saturn in Virgo, you tend to be industrious, efficient, practical, exacting, scientific, organized, shy, thrifty, studious, economical, and punctual. You have common sense and the ability to manage others, but may be a bit of a perfectionist. Detailed work does not bother you and you are able to focus and concentrate on the various minutia of any project. Your mind is deep and analytical and you probably have a good head for numbers. You may be prone to periods of depression or be prone to hypochondriac tendencies. Your work is usually neat and orderly and you dislike messes and dirt. There may be a desire for solitude. You need to stay busy because boredom brings unnecessary worry. Do not allow yourself to be critical of others. "], "Saturn in Libra": ["If you have Saturn in Libra, you are diplomatic, tactful, and you have balanced judgment which inspires trust. In matters if health there may be urinary problems or trouble with the kidneys. Saturn tends to obstruct the filtering action of the kidneys, allowing toxic elements to stay in the blood stream and intoxicate the body. Drinking distilled rather than spring, mineral or tap water would be better for your kidneys. There is a need for you to cooperate and share in harmony, patience, and love with other people. Marriage or partnerships may be restricting, requiring hard work and discipline so that you may learn the lessons of cooperation rather than competition. Marriage and partnerships give you a sense of security and for that reason you seek them out. You may marry for practical reasons, for money, or to someone a lot older or younger. Various possibilities exist with this position. You may take great trouble to find a mate who is able to demonstrate a similar integrity, and thus marry at a later age than most, or you may choose an older partner or a contemporary who is apt to be austere or undemonstrative. A desire for perfection may make you too demanding in the marriage or your view of marriage may be too conventional or old-fashioned. If Saturn is badly aspected, then you may be cold or regard marriage as a yoke with which you do not care to burden yourself. Or lastly, you may tell yourself that you will never find a partner who will measure up to your requirements."], "Saturn in Scorpio": ["If you have Saturn in Scorpio, you can be very self-disciplined. You have executive ability and are perceptive and extremely capable. You may have psychic ability. People may find you difficult to understand because of your reserved exterior and secretiveness. Your mind may be mechanically oriented and you are resourceful, even under the most adverse circumstances, patient and persistent. The action and energy of Mars is combined with the forethought of Saturn in a most wonderful combination. Whatever you do is done with intensity. On the negative side, though, there is danger of stubbornness, revenge, lack of forgiveness, resentment, and ruthlessness. Tendencies to grub for money and prestige can cause harm. There can be health problems with constipation or hemorrhoids. There is a need to transform your desires. You need to learn when and how to let go. This also applies to eliminative bodily functions. Holding onto anger can cause stones to develop in the gall bladder or kidneys."], "Saturn in Sagittarius": ["At its best, Saturn in Sagittarius gives a charitable and philanthropic turn to the mind with a desire to benefit and uplift mankind through discipline, system and self-help under just laws and true religious impulse. It brings trust, respect and honor in all undertakings. You are intuitive, philosophical, independent and persistent. Mental maturity comes later in life and promises success. You are generous with a wonderfully developed sense of responsibility. You have administrative and scientific abilities. Benefit can be gained from meditation and introspection. You may have poor circulation in the hips and legs. You need physical exercise and fresh air, especially in your sleeping quarters. On the negative side, you may be cynical, atheistic, selfishly ambitious, dogmatic, insincere and sarcastic. There is a need for everything to be proven before belief is possible. "], "Saturn in Capricorn": ["If you have Saturn in Capricorn, you are ambitious, self-controlled and you have organizing ability. You can be a disciplined, patient, hard worker who eventually receives the deserved rewards. There is a tendency to take life very seriously and duty and responsibility are very important to you. You understand that time and suffering serve a purpose and that happiness is not the final goal of existence. You may find it difficult to divide your energies between work and play. You have the ability to translate abstract concepts into concrete terms. You may experience feelings of loneliness and inadequacy and that could be one reason why you tend to work so long and hard. On the negative side, prestige and social standing may be extremely important to you and you will be tempted to do whatever you have to in order to acquire them. Selfishness and a great love and desire for power can also be present. "], "Saturn in Aquarius": ["If you have Saturn in Aquarius, you possess practical common sense, self-discipline and inner sources of strength which provide stamina. Although humane in nature with a friendly and sympathetic disposition, you may have difficulty in understanding other people's goals. You need to learn tolerance for other people and must develop forgiveness. You have the ability to exercise system, organization, discipline and tact in unusual and non- traditional ways. You can think ahead and plan things with an inventive flair. Seeing things in a whole new way is one of your strengths. You tendency is to be serious, impersonal, detached and scientific. On the negative side you can be opinionated, vindictive, cold and uncaring with a tendency to get quite aggravated if your plans are met with opposition."], "Saturn in Pisces": ["If you have Saturn in Pisces, it may be difficult for you to set boundaries for yourself and others, or to be as disciplined and organized as you want or need to be. Things have a way of getting lost in the shuffle of everyday life and it may be hard for you to keep your touch on the pulse of things around you. Sometimes you just get lost in the fog and can't see your way clearly. You are intuitive, sympathetic, sensitive, imaginative and self-sacrificing. You are a practical idealist and have a tendency to take life perhaps too seriously. You may have the sense that your present life's troubles are due to actions from the past. And this is probably the truth. You must reap what you have sown in previous lives and Saturn comes to exact his payment. Perhaps this is why you tend to feel more sorrow, perhaps, than the usual person. There can be success in working behind the scenes, away from the public eye, perhaps doing research or working in institutions. On the negative side you can be indecisive and moody, with a tendency to react emotionally to negative conditions or people. Depression can set in if success escapes you or if you feel that you have been unfairly treated. You need to develop faith in the future and let go of the past. Dis-identifying from other people's troubles will allow you to help them in their own sorrows. Teaching what you have learned in your experiences is a fine road to soul growth. ", " ", "See more "]}